In [1]:

import pandas as pd

In [2]:
data = {
    "nome":["teo", "nah", "lara", "maria"],
    "sobrenome": ["calvo", "ataide", "calvo", "calvo"],
    "idade": [31, 32, 31, 2]
}

In [3]:
data["idade"][0]

31

In [4]:
df = pd.DataFrame(data)
df

    nome sobrenome  idade
0    teo     calvo     31
1    nah    ataide     32
2   lara     calvo     31
3  maria     calvo      2

In [5]:
df["idade"].iloc[0]

31

In [6]:
df['sobrenome'].iloc[0]

'calvo'

In [7]:
df.iloc[0]

nome           teo
sobrenome    calvo
idade           31
Name: 0, dtype: object

In [8]:
df['idade']

0    31
1    32
2    31
3     2
Name: idade, dtype: int64

In [9]:
df.index=[3,2,1,0]
df

    nome sobrenome  idade
3    teo     calvo     31
2    nah    ataide     32
1   lara     calvo     31
0  maria     calvo      2

In [10]:
df["idade"][0]

2

In [11]:
df.index

Index([3, 2, 1, 0], dtype='int64')

In [12]:
df.columns

Index(['nome', 'sobrenome', 'idade'], dtype='object')

In [13]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 3 to 0
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nome       4 non-null      object
 1   sobrenome  4 non-null      object
 2   idade      4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 664.0 bytes

In [14]:
df.dtypes

nome         object
sobrenome    object
idade         int64
dtype: object

In [15]:
df['peso'] = [80, 53, 65, 14]

sumario = df.describe()

sumario['peso']['mean']

53.0

In [16]:
df.head()

    nome sobrenome  idade  peso
3    teo     calvo     31    80
2    nah    ataide     32    53
1   lara     calvo     31    65
0  maria     calvo      2    14

In [17]:
df.tail()

    nome sobrenome  idade  peso
3    teo     calvo     31    80
2    nah    ataide     32    53
1   lara     calvo     31    65
0  maria     calvo      2    14